requests/auth.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.e-controlnet.de/services/vii/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Login>
      <AppVersion>
        <![CDATA[2.3.5]]>
      </AppVersion>
      <Betriebssystem>
        <![CDATA[iOS]]>
      </Betriebssystem>
      <Benutzer>
        <![CDATA[{username}]]>
      </Benutzer>
      <AppId>
        <![CDATA[prod]]>
      </AppId>
      <Passwort>
        <![CDATA[{password}]]>
      </Passwort>
    </Login>
  </soap:Body>
</soap:Envelope>
